КАКерамика_моя_старая_база/src/Documents/РегистрацияСведенийОЗастрахованномЛицеФСС/РегистрацияСведенийОЗастрахованномЛицеФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияСведенийОЗастрахованномЛицеФСС</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СведенияОЗастрахованномЛицеФСС</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияПротокол</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНесоответствия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НесоответствиеДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НесоответствиеИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НесоответствиеПротокол</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибкиЛогическогоКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиЛогическогоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументаСЭДОФСС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/СведенияОЗастрахованныхЛицахФСС/СведенияОЗастрахованныхЛицахФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОЗастрахованныхЛицахФСС</name>
  <resources>
    <name>НаОформлении</name>
    <comment>Быстрый отбор для формы рабочего места. Заполняется в процедуре ПередЗаписью.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КОтправке</name>
    <comment>Быстрый отбор для формы рабочего места. Заполняется в процедуре ПередЗаписью.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВРаботе</name>
    <comment>Быстрый отбор для формы рабочего места. Заполняется в процедуре ПередЗаписью.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяСоздать</name>
    <comment>Заполняется на основании даты приема нового сотрудника. См. процедуру ДобавитьСведенияОНовыхСотрудниках модуля менеджера этого регистра.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяАктуализировать</name>
    <comment>Заполняется из кадровых данных. См. регистр ОчередьОбработкиКадровыхДанныхФСС.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоляТребующиеАктуализации</name>
    <comment>Заполняется из кадровых данных. См. регистр ОчередьОбработкиКадровыхДанныхФСС.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальнаяДатаОтправки</name>
    <comment>Заполняется при изменении кадровых данных. См. регистр ОчередьОбработкиКадровыхДанныхФСС.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследниеСведения</name>
    <type>
      <types>DocumentRef.СведенияОЗастрахованномЛицеФСС</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСведений</name>
    <comment>Состояние последних сведений.</comment>
    <type>
      <types>EnumRef.СостоянияДокументаСЭДОФСС</types>
    </type>
  </resources>
  <resources>
    <name>ОтправленныеСведения</name>
    <type>
      <types>DocumentRef.СведенияОЗастрахованномЛицеФСС</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияСведений</name>
    <comment>Регистрация отправленных сведений.</comment>
    <type>
      <types>DocumentRef.РегистрацияСведенийОЗастрахованномЛицеФСС</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеОтправки</name>
    <comment>Состояние отправленных сведений.</comment>
    <type>
      <types>EnumRef.СостоянияДокументаСЭДОФСС</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <comment>Дата отправки отправленных сведений.</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Скрыть</name>
    <comment>Включается по кнопке &quot;Не планируется отправлять (скрыть)&quot; списка.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСкрытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/СостоянияДокументаСЭДОФСС/СостоянияДокументаСЭДОФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументаСЭДОФСС</name>
  <enumValues>
    <name>НеПланируетсяОтправлять</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяСоздать</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяАктуализировать</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессеПодготовки</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПриОтправке</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаЛогическогоКонтроля</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
  <enumValues>
    <name>НеПринят</name>
  </enumValues>
  <enumValues>
    <name>ПринятСЗамечаниями</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/РегистрацияСведенийОЗастрахованномЛицеФСС/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата(); // АПК:143 Для фильтрации событий в журнале регистрации требуется дата сервера.
	КонецЕсли;
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	Если Не Доставлен Тогда
		ТекстОшибки = ДоставкаТекстОшибки;
	ИначеЕсли ЕстьОшибкиЛогическогоКонтроля Тогда
		ТекстОшибки = ОшибкиЛогическогоКонтроля;
	ИначеЕсли Не Зарегистрирован Тогда
		ТекстОшибки = РегистрацияПротокол;
	Иначе
		ТекстОшибки = НесоответствиеПротокол;
	КонецЕсли;
	ЕстьНесоответствия = ЗначениеЗаполнено(НесоответствиеИдентификатор)
		И ЗначениеЗаполнено(НесоответствиеПротокол);
	
	РеквизитыСведений = РеквизитыСведений();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСведений, "ФизическоеЛицо, ГоловнаяОрганизация");
	
	Состояние = СостояниеРегистрации();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СведенияОЗастрахованныхЛицахФСС.ПриЗаписиРегистрацииСведений(ЭтотОбъект, РеквизитыСведений());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СостояниеРегистрации()
	
	Если ЗначениеЗаполнено(ДоставкаТекстОшибки) Тогда // Дата отправки при этом не заполнена.
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.ОшибкаПриОтправке; // Ошибка при отправке.
		
	ИначеЕсли Не ЗначениеЗаполнено(ДатаОтправки) Тогда
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.ПустаяСсылка(); // Не отправлен.
		
	ИначеЕсли ЕстьОшибкиЛогическогоКонтроля Тогда
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.ОшибкаЛогическогоКонтроля; // Отправлен, получены ошибки.
		
	ИначеЕсли Не Доставлен
		Или Не ЗначениеЗаполнено(РегистрацияИдентификатор)
		Или ВРег(РегистрацияСтатус) = "RECEIVED" Тогда
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.Отправлен; // Отправлен, но не зарегистрирован.
		
	ИначеЕсли Не Зарегистрирован Тогда
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.НеПринят;
		
	ИначеЕсли ЕстьНесоответствия Тогда
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.ПринятСЗамечаниями;
		
	Иначе
		
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.Принят;
		
	КонецЕсли;
	
КонецФункции

Функция РеквизитыСведений()
	РеквизитыСведений = ОбщегоНазначенияБЗК.ЗначениеСвойства(ДополнительныеСвойства, "РеквизитыСведений");
	Если РеквизитыСведений <> Неопределено Тогда
		Возврат РеквизитыСведений;
	КонецЕсли;
	
	ТребуемыеРеквизитыСведений = РегистрыСведений.СведенияОЗастрахованныхЛицахФСС.ТребуемыеРеквизитыСведений();
	ТребуемыеРеквизитыСведений = СтрРазделить(ТребуемыеРеквизитыСведений, ", ", Ложь);
	ИменаПолейДляРегистрации = СтрРазделить("Ссылка, ФизическоеЛицо, ГоловнаяОрганизация", ", ", Ложь);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТребуемыеРеквизитыСведений, ИменаПолейДляРегистрации, Истина);
	ИменаРеквизитовСведений = СтрСоединить(ТребуемыеРеквизитыСведений, ", ");
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		РеквизитыСведений = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ИменаРеквизитовСведений);
	ИначеЕсли ЗначениеЗаполнено(ФизическоеЛицо) И ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		РеквизитыСведений = Документы.СведенияОЗастрахованномЛицеФСС.НайтиПоФизлицу(
			ФизическоеЛицо,
			ГоловнаяОрганизация,
			ИменаРеквизитовСведений);
	КонецЕсли;
	
	Если РеквизитыСведений = Неопределено Тогда
		РеквизитыСведений = Новый Структура(ИменаРеквизитовСведений);
		ЗаполнитьЗначенияСвойств(РеквизитыСведений, ЭтотОбъект);
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РеквизитыСведений", РеквизитыСведений);
	
	Возврат РеквизитыСведений;
КонецФункции

#КонецОбласти


#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
